Revit 2027 API
SunAndShadowSettings.ProjectLocationId Property
 Identifies the ProjectLocation element used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProjectLocationId { get; }
Public ReadOnly Property ProjectLocationId As ElementId
	Get
public:
property ElementId^ ProjectLocationId {
	ElementId^ get ();
}
member ProjectLocationId : ElementId with get
Property Value
ElementId
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace